{
    "posts":[
        {
            "id": 1,
            "postTitle": "Which coding language is the best?", 
            "postContent":"In the ever-evolving landscape of technology, a question frequently posed by aspiring developers and tech enthusiasts is about the optimal coding language to master. Many ponder upon this, seeking the most valuable and versatile language to invest their time and resources in. I was wondering which coding language is considered on average as the best language to learn is a sentiment shared by numerous individuals across the globe. The answer, however, isn't always straightforward. Factors like the specific goals, desired applications, and the region's dominant industries can influence the answer. Nonetheless, understanding the prevailing trends and industry demands can guide one towards a wise decision.",
            "img": "https://as1.ftcdn.net/v2/jpg/05/05/12/96/1000_F_505129668_YXHq2XRQZqlXiiFFfVe2zYdqCDgyrzVS.jpg",
            "category": "languages"
        },
        {
            "id": 2,
            "postTitle": "Why can coding be so stressfull", 
            "postContent":"I wanted to make a quick post in pursuit of finding out why coding can be so stressful!",
            "img": "https://cdn2.picryl.com/photo/1920/06/20/composition-c-by-piet-mondrian-museum-of-modern-art-2571948-c1fd6b-small.jpg",
            "category": "solutions"
        },
        {
            "id": 3,
            "postTitle": "Best gaming rig", 
            "postContent":"Hey guys, just building a gaming rig atm, I was wondering what specs I should be looking at getting? ",
            "img": "https://www.trustedreviews.com/wp-content/uploads/sites/54/2023/01/AlphaSync-PBA-Diamond-Gaming-Desktop-PC-10-920x693.jpg",
            "category": "hardware"
        },
        {
            "id": 4,
            "postTitle": "Does the GTX1080 still hold up today?", 
            "postContent":"I feel like my PC is a little outdated, it has a GTX1080, and I was wondering if it still holds up in 2023? ",
            "img": "https://upload.wikimedia.org/wikipedia/commons/3/3b/K%C3%A9t_Nvidia_GTX_1080_SLI-ban.jpg",
            "category": "hardware"
        },
        {
            "id": 5,
            "postTitle": "Alphabetical sort not working", 
            "postContent":"Hi everyone, I am currently working on an alphabetical sort algorithm, but it isnt working, any ideas? ",
            "img": "https://static.javatpoint.com/python/images/python-native-data-programs5.png",
            "category": "solutions"
        },
        {
            "id": 6,
            "postTitle": "What's with all the hate regarding Python??", 
            "postContent":"Every time I'm on reddit I see people talking badly about Python, why does the language have such a bad rep?",
            "img": "https://upload.wikimedia.org/wikipedia/commons/2/21/Python_image.jpg",
            "category": "languages"
        }]
}